app/Controllers/AssignTasks.php

    public function index()
    {
        $assign = $this->assign->findAll();
---
SELECT *
FROM `assign`

    public function edit($id_assign = null)
    {
        $assign = $this->assign->find($id_assign);
---
SELECT *
FROM `assign`
WHERE `assign`.`id_assign` = '1'

    public function update($id_assign= null)
    {
        $assigned = [
            "taskname" => $this->request->getPost('taskname'),
            "assignedto" => $this->request->getPost('assignedto'),
            "comment" => $this->request->getPost('comment'),
            "status" => $this->request->getPost('status'),
        ];

        $this->assign->update($id_assign, $assigned);
---
UPDATE `assign` SET `taskname` = 'halo', `assignedto` = 'Administrator', `comment` = 'test', `status` = 'On Progress'
WHERE `assign`.`id_assign` IN ('2')

    public function delete($id_assign = null)
    {
        $this->assign->delete($id_assign);
---
DELETE FROM `assign`
WHERE `id_assign` IN ('7')