app/Controllers/AssignTasks.php

SELECT *
FROM `employee`
---
    public function index()
    {
        $assign = $this->assign->findAll();
        $employee = $this->employeeModel->findAll();