app/Controllers/CreateToDoTasks.php

    public function index()
    {
        $todo = $this->todo->findAll();
---
SELECT *
FROM `todo`

    public function edit($id_todo = null)
    {
        $todo = $this->todo->find($id_todo);
---
SELECT *
FROM `todo`
WHERE `todo`.`id_todo` = '5'