app/Controllers/Create.php

    public function index()
    {
        $users = $this->users->findAll();
---
SELECT *
FROM `users`

    public function edit($id_users = null)
    {
        $users = $this->users->find($id_users);
---
SELECT *
FROM `users`
WHERE `users`.`id_users` = '5'