app/Controllers/Product.php

    public function index()
    {
        // $dataemployee = $this ->usermodel->get()->resultID->num_rows;
        // $data =[
        //     'title' => 'Users',
        //     'dataemployee' => $dataemployee
        // ];

        $datatodo = $this ->todo->get()->resultID->num_rows;
---
SELECT *
FROM `todo`