app/Controllers/ViewEmployeeTasks.php

    public function index()
    {
        $assign = $this->assign->paginate(6,'assign');
---
SELECT *
FROM `assign`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `assign`