app/Controllers/View.php

SELECT *
FROM `users`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $users = $this->users->paginate(6,'users');