app/Controllers/ViewMyTodo.php

    public function index()
    {
        $todo = $this->todo->paginate(6,'todo');
---
SELECT *
FROM `todo`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `todo`